=================================================
            Day 5 Agenda
=================================================
1. VTP:
VLAN Trunk Protocol
Easier and more efficient to manage VLAN database over the campus network. !VTP is not recommended to use by Cisco.

Cisco proprietary, but not recommended to implement.
VTP is organized into management domains -> VTP domains
    One switch can only be part of one VTP domain.
    VLAN database changes are advertised as VTP advertisements. -> VTP adv. will be sent out on the Trunk interfaces
    Must have at least one VTP Server Switches


Behavior of a switch is determined by the VTP mode and VTP version in use.

VTP modes:
    Server
    Transparent
    Client
    Off

Versions:
    v1(Default)
    v2
    v3
Not fully backward compatible. v1/2 Can utilize VLANs 1 - 1005, v3 1 - 4094

Advertisements(All versions): -> Advertised out on all TRUNK links. Sent as Multicast Frames
    VLANs
    Revision number
    VLAN Parameters

Revision numbers:
    Keep track of the most recent information
    Starts with 0 -> Increments with every VLAN change.
The VTP advertisement with the higher revision number will be added to the local VLAN database.

Advertisements forms:
    Summary advertisements
    Subset advertisements
    Advertisement request

VTP Synchronization:
    Higher revision number wins, and can cause if overrides current VLAN database.

VTP Pruning:
    More efficient use of trunks.
    Forwards specific advertisments about the VLANs the neighboring device has ports with.

Workbook entry:
Task 1: 
    A: Make sure that all of your switches are in factory reset mode.
        delete flash:vlan.dat
        write erase or erase startup-config
        reload
    B: Check if the devices you have are in factory status

            Switch#dir flash:
            Directory of flash:/

                3  drwx         256   Mar 1 1993 00:21:43 +00:00  c3560-ipservicesk9-mz.150-2.SE
            516  -rwx        3096   Mar 1 1993 00:13:13 +00:00  multiple-fs

            32514048 bytes total (11191296 bytes free)
            !
            Switch#sh vlan brief

            VLAN Name                             Status    Ports
            ---- -------------------------------- --------- -------------------------------
            1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                            Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                            Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                            Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                            Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                            Fa0/21, Fa0/22, Fa0/23, Fa0/24
                                                            Gi0/1, Gi0/2
            1002 fddi-default                     act/unsup
            1003 token-ring-default               act/unsup
            1004 fddinet-default                  act/unsup
            1005 trnet-default                    act/unsup

    C: Create default configuration -> Refer to DefConf.txt
        no ip domain-lookup
        hostname SW%
        line console  0
        logging synchronous
        privilege level 15
        exec-timeout 0 0

Task 3: Configure the VTP domain
    A: VTP domain name should be cisco_lab
    B: Authentication key should be supersecret
    C: Make sure that SW1 will be the VTP Server and advertising VLANs 10, 20, 30, 40
    D: Make sure that SW2 is not affected by changes in the VTP domain. Introduce VLAN 50, 60 to the domain and make sure SW3 receives updates. Implement VLAN 70, 80 on SW2.
    E: Make sure that SW3 cannot create local VLANs, verify by adding VLAN 100

Task 4: Introduce SW4 to the network
    A: Make sure that SW4 is going to be the VTP Server.
    B: Make sure that only VLANs 1, 90 and 100 are advertised.

Task 5: VTP Pruning !!!! Need to revisit!!!


Default Behavior:
    SW1#show vtp status
    VTP Version capable             : 1 to 3
    VTP version running             : 1
    VTP Domain Name                 :
    VTP Pruning Mode                : Disabled
    VTP Traps Generation            : Disabled
    Device ID                       : 0014.f2e4.f200
    Configuration last modified by 0.0.0.0 at 0-0-00 00:00:00
    Local updater ID is 0.0.0.0 (no valid interface found)

    Feature VLAN:
    --------------
    VTP Operating Mode                : Server
    Maximum VLANs supported locally   : 1005
    Number of existing VLANs          : 5
    Configuration Revision            : 0
    MD5 digest                        : 0x57 0xCD 0x40 0x65 0x63 0x59 0x47 0xBD
                                        0x56 0x9D 0x4A 0x3E 0xA5 0x69 0x35 0xBC
                                
                                Resolution:
Task 3 A:
SW1:
SW1(config)#vtp domain cisco_lab
Changing VTP domain name from NULL to cisco_lab
SW1(config)#
*Mar  1 00:14:35.443: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to cisco_lab.

SW2:
SW2(config)#vtp domain cisco_lab
Changing VTP domain name from NULL to cisco_lab
SW2(config)#
*Mar  1 00:15:03.318: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to cisco_lab.

SW3:
SW3(config)#vtp domain cisco_lab
Changing VTP domain name from NULL to cisco_lab
SW3(config)#
*Mar  1 01:19:13.077: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to cisco_lab.

SW4:
SW4(config)#vtp domain cisco_lab
Changing VTP domain name from NULL to cisco_lab
SW4(config)#
*Mar  1 01:19:36.867: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to cisco_lab.

Task 3 B:
SW1(config)#vtp password supersecret
Setting device VTP password to supersecret

SW2(config)#vtp password supersecret
Setting device VTP password to supersecret


SW3(config)#vtp password supersecret
Setting device VTP password to supersecret

SW4(config)#vtp password supersecret
Setting device VTP password to supersecret

Task 3 C:
SW4(config)#vlan 10
SW4(config-vlan)#vlan 20
SW4(config-vlan)#vlan 30
SW4(config-vlan)#vlan 40
SW4(config-vlan)#exit

SW1#sh vtp status
VTP Version capable             : 1 to 3
VTP version running             : 1
VTP Domain Name                 : cisco_lab
VTP Pruning Mode                : Disabled
VTP Traps Generation            : Disabled
Device ID                       : 0014.f2e4.f200
Configuration last modified by 0.0.0.0 at 3-1-93 00:25:39
Local updater ID is 0.0.0.0 (no valid interface found)

Feature VLAN:
--------------
VTP Operating Mode                : Server
Maximum VLANs supported locally   : 1005
Number of existing VLANs          : 9
Configuration Revision            : 4
MD5 digest                        : 0xF4 0x10 0xBF 0x80 0xD2 0x75 0xC7 0x8E
                                    0x0C 0x46 0x26 0x98 0x5F 0x47 0x64 0xFE
SW1# sh vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Gi0/1
                                                Gi0/2
10   VLAN0010                         active
20   VLAN0020                         active
30   VLAN0030                         active
40   VLAN0040                         active
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

SW2#sh vtp sta
VTP Version capable             : 1 to 3
VTP version running             : 1
VTP Domain Name                 : cisco_lab
VTP Pruning Mode                : Disabled
VTP Traps Generation            : Disabled
Device ID                       : 0014.f2cf.8f00
Configuration last modified by 0.0.0.0 at 3-1-93 00:25:39
Local updater ID is 0.0.0.0 (no valid interface found)

Feature VLAN:
--------------
VTP Operating Mode                : Server
Maximum VLANs supported locally   : 1005
Number of existing VLANs          : 9
Configuration Revision            : 4
MD5 digest                        : 0xF4 0x10 0xBF 0x80 0xD2 0x75 0xC7 0x8E
                                    0x0C 0x46 0x26 0x98 0x5F 0x47 0x64 0xFE

SW2#sh vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/23, Gi0/1, Gi0/2
10   VLAN0010                         active
20   VLAN0020                         active
30   VLAN0030                         active
40   VLAN0040                         active
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup


Task 3 D:

SW2(config)#vtp mode transparent
Setting device to VTP Transparent mode for VLANS.
SW2(config)#vlan 70
SW2(config-vlan)#vlan 80
SW2(config-vlan)#^Z
SW2#sh vtp status
VTP Version capable             : 1 to 3
VTP version running             : 1
VTP Domain Name                 : cisco_lab
VTP Pruning Mode                : Disabled
VTP Traps Generation            : Disabled
Device ID                       : 0014.f2cf.8f00
Configuration last modified by 0.0.0.0 at 3-1-93 00:25:39

Feature VLAN:
--------------
VTP Operating Mode                : Transparent
Maximum VLANs supported locally   : 1005
Number of existing VLANs          : 11
Configuration Revision            : 0
MD5 digest                        : 0xBB 0xD1 0xC5 0x64 0x31 0xC5 0x36 0x64
                                    0x26 0x91 0x59 0xE6 0x6D 0x3F 0xB8 0xE1
SW2#sh vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/23, Gi0/1, Gi0/2
10   VLAN0010                         active
20   VLAN0020                         active
30   VLAN0030                         active
40   VLAN0040                         active
70   VLAN0070                         active
80   VLAN0080                         active
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup



SW1(config)#vlan 50
SW1(config-vlan)#vlan 60
SW1(config-vlan)#^Z

SW1#sh vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Gi0/1
                                                Gi0/2
10   VLAN0010                         active
20   VLAN0020                         active
30   VLAN0030                         active
40   VLAN0040                         active
50   VLAN0050                         active
60   VLAN0060                         active
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup
SW1#sh vtp sta
SW1#sh vtp status
VTP Version capable             : 1 to 3
VTP version running             : 1
VTP Domain Name                 : cisco_lab
VTP Pruning Mode                : Disabled
VTP Traps Generation            : Disabled
Device ID                       : 0014.f2e4.f200
Configuration last modified by 0.0.0.0 at 3-1-93 00:33:51
Local updater ID is 0.0.0.0 (no valid interface found)

Feature VLAN:
--------------
VTP Operating Mode                : Server
Maximum VLANs supported locally   : 1005
Number of existing VLANs          : 11
Configuration Revision            : 6
MD5 digest                        : 0x12 0xC8 0x36 0x74 0xF4 0x0E 0x0D 0x65
                                    0x81 0x74 0xCC 0xA5 0x30 0x3B 0xB7 0x8A
SW3#sh vlan bri

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/23, Fa0/24, Gi0/1
                                                Gi0/2
10   VLAN0010                         active
20   VLAN0020                         active
30   VLAN0030                         active
40   VLAN0040                         active
50   VLAN0050                         active
60   VLAN0060                         active
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

SW3#sh vtp status
VTP Version capable             : 1 to 3
VTP version running             : 1
VTP Domain Name                 : cisco_lab
VTP Pruning Mode                : Disabled
VTP Traps Generation            : Disabled
Device ID                       : 0014.f2cf.9f80
Configuration last modified by 0.0.0.0 at 3-1-93 00:33:51
Local updater ID is 0.0.0.0 (no valid interface found)

Feature VLAN:
--------------
VTP Operating Mode                : Server
Maximum VLANs supported locally   : 1005
Number of existing VLANs          : 11
Configuration Revision            : 6
MD5 digest                        : 0x12 0xC8 0x36 0x74 0xF4 0x0E 0x0D 0x65
                                    0x81 0x74 0xCC 0xA5 0x30 0x3B 0xB7 0x8A

Task 3 E:
SW3(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
SW3(config)#vlan 100
VTP VLAN configuration not allowed when device is in CLIENT mode.

Task 4 A & B:
SW4(config)#vtp domain cisco_lab
Changing VTP domain name from NULL to cisco_lab
SW4(config)#vtp password supersecret
Setting device VTP password to supersecret
SW4(config)#vlan 10
SW4(config-vlan)#no vlan 10
SW4(config)#vlan 10
SW4(config-vlan)#no vlan 10
SW4(config)#vlan 10
SW4(config-vlan)#no vlan 10
SW4(config)#vlan 90
SW4(config-vlan)#vlan 100
SW4#sh vlan brie

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Gi0/1, Gi0/2
90   VLAN0090                         active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23
100  VLAN0100                         active
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup

SW4#sh vtp status
VTP Version capable             : 1 to 3
VTP version running             : 1
VTP Domain Name                 : cisco_lab
VTP Pruning Mode                : Disabled
VTP Traps Generation            : Disabled
Device ID                       : 0014.f2e4.e180
Configuration last modified by 0.0.0.0 at 3-1-93 00:18:53
Local updater ID is 0.0.0.0 (no valid interface found)

Feature VLAN:
--------------
VTP Operating Mode                : Server
Maximum VLANs supported locally   : 1005
Number of existing VLANs          : 7
Configuration Revision            : 8
MD5 digest                        : 0x8F 0x07 0x64 0x4E 0xFD 0x1B 0xEB 0x14
                                    0x64 0x00 0xCE 0x99 0x06 0x82 0x95 0xBB
SW3#sh vlan brie

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/23, Gi0/1, Gi0/2
90   VLAN0090                         active
100  VLAN0100                         active
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup
SW3#sh vtp status | i Rev
Configuration Revision            : 8

SW1#sh vlan brief

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Fa0/1, Fa0/2, Fa0/3, Fa0/4
                                                Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                Fa0/21, Fa0/22, Fa0/23, Gi0/1
                                                Gi0/2
90   VLAN0090                         active
100  VLAN0100                         active
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup
SW1#sh vtp status | i Rev
Configuration Revision            : 8

